---
kind: property
id: P:Autodesk.Revit.DB.InCanvasControlData.Position
source: html/aec870fe-2009-8281-ddb9-28c25d9909f2.htm
---
# Autodesk.Revit.DB.InCanvasControlData.Position Property

The position of the in-canvas control in model coordinates.

## Syntax (C#)
```csharp
public XYZ Position { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null